# Selected

## Description
Function Selected returns the selection status of the referenced object.

```pascal
FUNCTION Selected(h : HANDLE): BOOLEAN;
```

```python
def vs.Selected(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from All Versions

## Category
* Selection